/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   op.c                                               :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: aelphias <aelphias@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/09/25 00:11:29 by denis             #+#    #+#             */
/*   Updated: 2020/12/15 15:38:45 by aelphias         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "op.h"

/* Cтруктура, которая описывает каждую операцию, определенную в языке ассемблера. */

t_op    op_tab[17] =
{
	{"live", 1, {T_DIR}, 1, 10, "alive", 0, 0},
	/*На операцию live возложены две функции:
    Она засчитывает, что каретка, которая выполняет операцию live, жива.
    Если указанный в качестве аргумента операции live номер совпадает с номером игрока, то она засчитывает,
	что это игрок жив. Например, если значение аргумента равно -2, значит игрок с номером 2 жив.
*/
	{"ld", 2, {T_DIR | T_IND, T_REG}, 2, 5, "load", 1, 0}, // загрузка значения в регистр. 
	{"st", 2, {T_REG, T_IND | T_REG}, 3, 5, "store", 1, 0}, // записывает значение из регистра
	{"add", 3, {T_REG, T_REG, T_REG}, 4, 10, "addition", 1, 0}, // складывает значения в регистрах
	{"sub", 3, {T_REG, T_REG, T_REG}, 5, 10, "soustraction", 1, 0},
	{"and", 3, {T_REG | T_DIR | T_IND, T_REG | T_IND | T_DIR, T_REG}, 6, 6,
		"et (and  r1, r2, r3   r1&r2 -> r3", 1, 0},
	{"or", 3, {T_REG | T_IND | T_DIR, T_REG | T_IND | T_DIR, T_REG}, 7, 6,
		"ou  (or   r1, r2, r3   r1 | r2 -> r3", 1, 0},
	{"xor", 3, {T_REG | T_IND | T_DIR, T_REG | T_IND | T_DIR, T_REG}, 8, 6,
		"ou (xor  r1, r2, r3   r1^r2 -> r3", 1, 0},
	{"zjmp", 1, {T_DIR}, 9, 20, "jump if zero", 0, 1}, //может перебросить нас на N-ое количество байтов вперед или назад.
	{"ldi", 3, {T_REG | T_DIR | T_IND, T_DIR | T_REG, T_REG}, 10, 25,
		"load index", 1, 1},
	{"sti", 3, {T_REG, T_REG | T_DIR | T_IND, T_DIR | T_REG}, 11, 25,
		"store index", 1, 1},
	{"fork", 1, {T_DIR}, 12, 800, "fork", 0, 1},
	{"lld", 2, {T_DIR | T_IND, T_REG}, 13, 10, "long load", 1, 0},
	{"lldi", 3, {T_REG | T_DIR | T_IND, T_DIR | T_REG, T_REG}, 14, 50,
		"long load index", 1, 1},
	{"lfork", 1, {T_DIR}, 15, 1000, "long fork", 0, 1},
	{"aff", 1, {T_REG}, 16, 2, "aff", 1, 0},
	{0, 0, {0}, 0, 0, 0, 0, 0}
};